KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ОтражениеВыпуска/КАНАТ_ОтражениеВыпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КАНАТ_ОтражениеВыпуска</name>
</mdclass:DataProcessor>

KanatERPSukhova.КанатАдаптация/src/Documents/ЭтапПроизводства2_2/ЭтапПроизводства2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="03503ac6-a4b9-4d70-b0ef-949dac7b8de4">
  <name>ЭтапПроизводства2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.КАНАТ_СоответствиеГрупповыхУпаковокСериямНоменклатуры</registerRecords>
  <attributes>
    <name>КАНАТ_КомментарийКЗаказу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Сертификат</name>
    <type>
      <types>CatalogRef.КАНАТ_Сертификаты</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="49fb8c7a-a984-433d-9013-98b3f1808eba">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0662487e-07e7-4fe3-b008-ffb293a9f154">
    <name>Спецификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="38ea66f4-5bfa-48f1-8431-a99d27fcf31d">
    <name>ДатаПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="dc035f49-1f37-4bf6-a369-751f132442a2">
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_Сертификат</name>
      <type>
        <types>CatalogRef.КАНАТ_Сертификаты</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="20aa6e93-6a18-4526-830f-8d45d3e04bb6">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5d7b896b-c4b4-4604-9f9b-3b0fcf1196e3">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="42da4e01-6f2b-447f-a8ce-82c02d461afd">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="691cd7ff-4cd5-4d21-a6a6-32338ca8eb43">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="3a4b1c3c-2a58-45b8-bea3-df1e63deaecc">
    <name>РасходМатериаловИРабот</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f770e39d-256e-4caa-a806-c8d8fbdc962b">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4bfa3470-ec68-4384-ab44-61dc34f81542">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c2a5e8ce-e0dd-4c5e-bacb-a38121ee5440">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ca22f78a-e6c7-4d0a-abdf-dafcd0e7e8ca">
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ОтражениеВыпуска/ObjectModule.bsl
// Функция возвращает структуру с описанием выпуска документа ЭтапПроизводства2_2
// Параметры:
//  СсылкаНаЭтап - ссылка на документ ЭтапПроизводства2_2
// Ключи возвращаемой структуры
//  Строки - сгруппированные строки ТЧ ВыходныеИзделия (сгруппированы по ключевым для назначения серий полям)
//  ПрисвоитьСерии - булево, равно Истина, если количество серий меньше чем количество выпуска
Функция ПолучитьСтруктуруСтрокВыпуска(СсылкаНаЭтап,ТекущийЭтапОбъект=Неопределено)Экспорт
	
	СтруктураСтрокВыпуска = Новый Структура("Строки,ПрисвоитьСерии");
	СтруктураСтрокВыпуска.ПрисвоитьСерии = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ТекущийЭтапОбъект) = Тип("Структура") Тогда
		Запрос.УстановитьПараметр("ВыходныеИзделияСерии"	,ПолучитьТЗИзМассиваСтруктур(ТекущийЭтапОбъект.ВыходныеИзделияСерии));
		Запрос.УстановитьПараметр("ВыходныеИзделия"			,ПолучитьТЗИзМассиваСтруктур(ТекущийЭтапОбъект.ВыходныеИзделия));
		Запрос.Текст = 
		"ВЫБРАТЬ *
		|Поместить ВтВыходныеИзделия
		|ИЗ
		|	&ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ *
		|Поместить ВтВыходныеИзделияСерии
		|ИЗ
		|	&ВыходныеИзделияСерии КАК ЭтапПроизводства2_2ВыходныеИзделияСерии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + ?(ТипЗнч(ТекущийЭтапОбъект) = Тип("Структура"),Символы.ПС,"") +
	"ВЫБРАТЬ
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.ДатаПроизводства КАК ДатаПроизводства,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Назначение КАК Назначение,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Номенклатура КАК Номенклатура,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Отменено КАК Отменено,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Подразделение КАК Подразделение,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Получатель КАК Получатель,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Произведено КАК Произведено,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Характеристика КАК Характеристика,
	|	СУММА(ЭтапПроизводства2_2ВыходныеИзделияСерии.Количество) КАК Количество,
	|	МИНИМУМ(ЭтапПроизводства2_2ВыходныеИзделияСерии.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ ВтСерии
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ВыходныеИзделияСерии КАК ЭтапПроизводства2_2ВыходныеИзделияСерии
	|ГДЕ
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.ДатаПроизводства,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Назначение,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Номенклатура,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Отменено,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Подразделение,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Получатель,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Произведено,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапПроизводства2_2ВыходныеИзделия.ДатаПроизводства КАК ДатаПроизводства,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура КАК Номенклатура,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Отменено КАК Отменено,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Подразделение КАК Подразделение,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Получатель КАК Получатель,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Произведено КАК Произведено,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Характеристика КАК Характеристика,
	|	СУММА(ЭтапПроизводства2_2ВыходныеИзделия.Количество) КАК Количество,
	|	МИНИМУМ(ЭтапПроизводства2_2ВыходныеИзделия.НомерСтроки) КАК НомерСтроки,
	|	ЕСТЬNULL(ВтСерии.Количество, 0) КАК КоличествоСерий
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСерии КАК ВтСерии
	|		ПО (ВтСерии.ДатаПроизводства = ЭтапПроизводства2_2ВыходныеИзделия.ДатаПроизводства)
	|			И (ВтСерии.Назначение = ЭтапПроизводства2_2ВыходныеИзделия.Назначение)
	|			И (ВтСерии.Номенклатура = ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура)
	|			И (ВтСерии.Отменено = ЭтапПроизводства2_2ВыходныеИзделия.Отменено)
	|			И (ВтСерии.Подразделение = ЭтапПроизводства2_2ВыходныеИзделия.Подразделение)
	|			И (ВтСерии.Получатель = ЭтапПроизводства2_2ВыходныеИзделия.Получатель)
	|			И (ВтСерии.Произведено = ЭтапПроизводства2_2ВыходныеИзделия.Произведено)
	|			И (ВтСерии.Характеристика = ЭтапПроизводства2_2ВыходныеИзделия.Характеристика)
	|ГДЕ
	|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапПроизводства2_2ВыходныеИзделия.ДатаПроизводства,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Отменено,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Подразделение,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Получатель,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Произведено,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Характеристика,
	|	ЕСТЬNULL(ВтСерии.Количество, 0)";
	
	Если ТипЗнч(ТекущийЭтапОбъект) = Тип("Структура") Тогда
		//Секции ИЗ
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ЭтапПроизводства2_2.ВыходныеИзделияСерии КАК ЭтапПроизводства2_2ВыходныеИзделияСерии",
									"ВтВыходныеИзделияСерии КАК ЭтапПроизводства2_2ВыходныеИзделияСерии");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия",
									"ВтВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия");
		
		//Секции ГДЕ
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ЭтапПроизводства2_2ВыходныеИзделияСерии.Ссылка = &Ссылка",
									"Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = &Ссылка",
									"Истина");
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка",СсылкаНаЭтап);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выгрузка = РезультатЗапроса.Выгрузить();
	СтруктураСтрокВыпуска.Строки = ОбщегоНазначения.ТаблицаЗначенийВМассив(Выгрузка);
	
	Для каждого СтрокаТЗ Из Выгрузка Цикл
		Если СтрокаТЗ.КоличествоСерий < СтрокаТЗ.Количество Тогда
			СтруктураСтрокВыпуска.ПрисвоитьСерии = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураСтрокВыпуска;
	
КонецФункции

Функция ПолучитьТЗИзМассиваСтруктур(МассивСтруктур)
	
	СоответсвиеТипов = Новый Соответствие;
	СоответсвиеТипов.Вставить(Тип("Число")											,Новый ОписаниеТипов("Число"));
	СоответсвиеТипов.Вставить(Тип("Строка")											,Новый ОписаниеТипов("Строка"));
	СоответсвиеТипов.Вставить(Тип("Дата")											,Новый ОписаниеТипов("Дата"));
	СоответсвиеТипов.Вставить(Тип("Булево")											,Новый ОписаниеТипов("Булево"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.Номенклатура")					,Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.ХарактеристикиНоменклатуры")	,Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.УпаковкиЕдиницыИзмерения")		,Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.СтруктураПредприятия")			,Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.Склады")						,Новый ОписаниеТипов("СправочникСсылка.Склады"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.Назначения")					,Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.СерииНоменклатуры")				,Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	//СоответсвиеТипов.Вставить(Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов")	,Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	//СоответсвиеТипов.Вставить(Тип("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов"),Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов"));
	//СоответсвиеТипов.Вставить(Тип("Характеристика.СтатьиРасходов")					,Новый ОписаниеТипов("Характеристика.СтатьиРасходов"));
	//СоответсвиеТипов.Вставить(Тип("Характеристика.СтатьиАктивовПассивов")			,Новый ОписаниеТипов("Характеристика.СтатьиАктивовПассивов"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.КлючиАналитикиУчетаНоменклатуры"),Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиУчетаНоменклатуры"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.РесурсныеСпецификации")			,Новый ОписаниеТипов("СправочникСсылка.РесурсныеСпецификации"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.ПричиныОтменыПроизводства")		,Новый ОписаниеТипов("СправочникСсылка.ПричиныОтменыПроизводства"));
	СоответсвиеТипов.Вставить(Тип("ДокументСсылка.ЭтапПроизводства2_2")				,Новый ОписаниеТипов("ДокументСсылка.ЭтапПроизводства2_2"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.СтруктураПредприятия")			,Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.НастройкиСчетовУчетаПрочихОпераций"),Новый ОписаниеТипов("СправочникСсылка.НастройкиСчетовУчетаПрочихОпераций"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.СерииНоменклатуры")				,Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	
	Если МассивСтруктур.Количество() > 0 Тогда
		ПерваяСтруктура = МассивСтруктур[0];
		ТЗ = Новый ТаблицаЗначений;
		Для Каждого КлючЗначение из ПерваяСтруктура Цикл
			Если СоответсвиеТипов.Получить(ТипЗнч(КлючЗначение.Значение)) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ТЗ.Колонки.Добавить(КлючЗначение.Ключ, СоответсвиеТипов.Получить(ТипЗнч(КлючЗначение.Значение)));
		КонецЦикла;
		Для каждого СтрокаТЧ Из МассивСтруктур Цикл
			НоваяСтрока = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ);
		КонецЦикла;
		Возврат ТЗ;
	Иначе
		Возврат МассивСтруктур;
	КонецЕсли;
	
КонецФункции
